CSI API ETABS v1
cSapModel.TreeSuspendUpdateData Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int TreeSuspendUpdateData(
	bool updateAtResume
)
Function TreeSuspendUpdateData (
	updateAtResume As Boolean
) As Integer
Dim instance As cSapModel
Dim updateAtResume As Boolean
Dim returnValue As Integer
returnValue = instance.TreeSuspendUpdateData(updateAtResume)
int TreeSuspendUpdateData(
	bool updateAtResume
)
abstract TreeSuspendUpdateData :
        updateAtResume : bool -> int
Parameters
updateAtResume
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cSapModel Interface
ETABSv1 Namespace